CSI API ETABS v1
cFunction.GetValues Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetValues(
	string Name,
	ref int NumberItems,
	ref double[] MyTime,
	ref double[] Value
)
Function GetValues (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef MyTime As Double(),
	ByRef Value As Double()
) As Integer
Dim instance As cFunction
Dim Name As String
Dim NumberItems As Integer
Dim MyTime As Double()
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GetValues(Name,
	NumberItems, MyTime, Value)
int GetValues(
	String^ Name,
	int% NumberItems,
	array<double>^% MyTime,
	array<double>^% Value
)
abstract GetValues :
        Name : string *
        NumberItems : int byref *
        MyTime : float[] byref *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
MyTime
Type: System.Double[]
Value
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cFunction Interface
ETABSv1 Namespace